[
  {
    "Id": "1",
    "Title": "Fresh Fruits Prices in Belgium",
    "Content": "Belgium offers a variety of fresh fruits at competitive prices. Apples cost around €2.50-3.00 per kg, with Belgian varieties like Jonagold being popular. Pears range from €2.80-3.50 per kg. Bananas are typically €1.50-2.00 per kg. Strawberries during season cost €3.50-5.00 per 500g. Oranges are priced at €2.00-2.50 per kg. Local markets often offer better prices than supermarkets, especially for seasonal fruits."
  },
  {
    "Id": "2",
    "Title": "Belgian Delicatessen Prices",
    "Content": "Belgian delicatessens offer premium quality products. Traditional Belgian ham costs €15-25 per kg. Artisanal cheeses range from €12-30 per kg, with aged Gouda and local varieties being popular. Belgian pâtés cost €8-15 per 250g. Smoked salmon is priced at €25-35 per kg. Premium Belgian chocolate costs €20-40 per kg. Local specialty sausages range from €10-18 per kg. Many delis offer tasting portions and custom slicing services."
  },
  {
    "Id": "3",
    "Title": "Vegetable Market Prices Belgium",
    "Content": "Belgian vegetable markets offer fresh, locally grown produce. Potatoes, a Belgian staple, cost €1.00-1.50 per kg. Carrots are priced at €1.20-1.80 per kg. Belgian endives cost €2.50-3.50 per kg. Leeks range from €2.00-2.80 per kg. Tomatoes cost €2.50-4.00 per kg depending on variety. Brussels sprouts, when in season, are €2.00-3.00 per kg. Onions are typically €1.50-2.00 per kg."
  },
  {
    "Id": "4",
    "Title": "Organic Food Prices in Belgium",
    "Content": "Organic produce in Belgium commands premium prices but offers superior quality. Organic apples cost €3.50-4.50 per kg. Organic vegetables are typically 30-50% more expensive than conventional ones. Organic potatoes cost €2.00-2.50 per kg. Organic carrots are priced at €2.50-3.00 per kg. Organic milk costs €1.20-1.50 per liter. Organic eggs range from €3.50-4.50 per dozen. Many Belgian farmers markets specialize in organic produce."
  },
  {
    "Id": "5",
    "Title": "Seasonal Price Variations Belgium",
    "Content": "Food prices in Belgium vary significantly by season. Summer brings cheaper fruits: strawberries drop to €2.50 per 500g, cherries cost €4.00-6.00 per kg. Winter vegetables like cabbage cost €1.50-2.00 per kg. Asparagus season (April-June) sees prices at €8-12 per kg. Pumpkins in autumn cost €1.50-2.50 per kg. Fresh herbs are cheapest in summer at €1.00-2.00 per bunch. Planning purchases around seasons can save 20-40% on grocery bills."
  },
  {
    "Id": "6",
    "Title": "Belgian Supermarket vs Market Prices",
    "Content": "Price comparison between Belgian supermarkets and local markets reveals interesting patterns. Supermarkets offer convenience but markets often provide better value. Markets typically offer 10-20% lower prices on fresh produce. Delhaize and Carrefour are premium supermarkets with higher prices. Lidl and Aldi offer competitive pricing, often matching market prices. Weekend markets in Brussels, Antwerp, and Ghent offer the best deals. Bulk buying at markets can reduce costs by 15-25%. Local farmers markets support regional economy and offer fresher products."
  }
]
