{
  "metadata": {
    "title": "BELGIAN SUPERMARKET BUSINESS INTELLIGENCE",
    "icon": "📊",
    "flag": "🇧🇪",
    "welcomeMessage": "Welcome to your supermarket business intelligence assistant!",
    "capabilityDescription": "I provide competitive analysis, market insights, and strategic recommendations for supermarket chain management",
    "additionalInfo": "Optimize pricing strategies, procurement decisions, and market positioning across Belgium"
  },
  "documents": [
    {
      "Id": "1",
      "Title": "Competitive Pricing Intelligence - Market Position Analysis",
      "Content": "Market positioning by chain: Delhaize (premium, 15-20% above market average, focus on quality and convenience), Carrefour (mainstream, 5-10% above average, hypermarket strategy), Colruyt (value-quality balance, market average pricing, strong loyalty program), Lidl (discount leader, 20-25% below average, limited SKU strategy), Aldi (ultra-discount, 25-30% below average, private label focus). Pricing gaps analysis: Fresh produce shows biggest variance (up to 40% between premium and discount), packaged goods more standardized (10-15% variance). Strategic opportunity: Mid-market positioning between Colruyt and Carrefour shows 8-12% margin potential with proper execution."
    },
    {
      "Id": "2",
      "Title": "Procurement Strategy - Supplier Cost Analysis Belgium",
      "Content": "Wholesale pricing intelligence: Direct farm procurement saves 35-45% vs distributors (seasonal produce), Belgian suppliers offer 10-15% cost advantage over imports (dairy, vegetables), Volume discounts: 5% at €100K monthly, 12% at €500K, 18% at €1M+ monthly purchases. Seasonal procurement windows: Asparagus (April-June, lock prices in February), Strawberries (May-August, contract in March), Apples (September-February, secure storage capacity by July). Private label opportunities: 25-35% higher margins vs national brands, minimum €2M investment for dedicated production lines. Supply chain optimization: Regional distribution centers reduce costs by 8-12%, automated ordering systems cut procurement overhead by 15-20%."
    },
    {
      "Id": "3",
      "Title": "Regional Market Analysis - Store Performance Optimization",
      "Content": "Brussels market dynamics: Higher operating costs (rent +40%, labor +25%), premium positioning essential, target demographics favor convenience and quality over price. Average basket: €45-65, frequency 2.1x/week. Antwerp opportunities: Port logistics advantage (-15% distribution costs), mixed demographics allow dual positioning, growing expatriate community values international brands. Average basket: €35-50, frequency 2.4x/week. Ghent student market: Price-sensitive segment, bulk buying patterns, promotional responsiveness +180% vs average. Average basket: €25-35, frequency 3.2x/week. Optimal store formats: Brussels (convenience, 800-1200m²), Antwerp (hypermarket, 2000-3500m²), Ghent (compact super, 1000-1500m²)."
    },
    {
      "Id": "4",
      "Title": "Inventory Management Intelligence - Category Performance",
      "Content": "High-velocity categories: Fresh produce (35% of traffic, 18% margin, 2-day turnover), Dairy (28% of baskets, 22% margin, 4-day turnover), Bread/Bakery (45% of visits, 35% margin, daily turnover). Margin optimization opportunities: Prepared foods (45-60% margin, growing 12% annually), Organic lines (35-50% margin, premium positioning), Private label expansion (25-40% higher margins vs national brands). Seasonal inventory planning: Summer (frozen foods +40%, BBQ items +200%, ice cream +180%), Winter (soups +85%, comfort foods +60%, vitamin supplements +45%). Dead stock reduction: Implement dynamic pricing algorithms (reduce waste by 25%), cross-category bundling strategies, supplier return agreements for slow-moving items."
    },
    {
      "Id": "5",
      "Title": "Customer Analytics - Shopping Behavior Intelligence",
      "Content": "Shopping pattern analysis: Peak hours (Thursday 17-19h, Friday 16-20h, Saturday 9-12h, Sunday 15-18h), Basket composition: Planned purchases 65%, impulse purchases 35% (opportunity for strategic placement). Customer segmentation: Price-sensitive (35%, focus on promotions and private label), Quality-focused (25%, premium positioning and fresh categories), Convenience-oriented (40%, ready meals and extended hours). Loyalty program effectiveness: Colruyt Xtra (85% participation, +22% basket value), Carrefour stamps (60% participation, +15% frequency), Delhaize Plus (+18% retention, premium tier activation). Cross-selling opportunities: Fresh produce → prepared foods (conversion rate 28%), Dairy → bread/bakery (45% correlation), Wine → cheese/delicatessen (65% premium basket uplift)."
    },
    {
      "Id": "6",
      "Title": "Promotional Strategy - ROI Analysis and Optimization",
      "Content": "Promotional effectiveness by category: Fresh produce (25% volume increase, 12% margin reduction, net positive ROI), Packaged goods (40% volume increase, 18% margin reduction, break-even ROI), Electronics (60% volume increase, 8% margin reduction, high ROI). Timing optimization: End-of-month promotions (+35% effectiveness due to payroll cycles), Pre-weekend fresh promotions (Thursday-Friday, +28% produce sales), Back-to-school period (August-September, +45% stationery/household items). Competitive response analysis: Lidl promotions trigger 15-20% temporary traffic loss, Aldi leaflet distribution impacts sales within 3km radius by 8-12%. Bundle strategy: Meal solutions increase basket value by €12-18, Cross-category promotions (buy 2 get 1 free across departments) improve basket diversity by 25%."
    },
    {
      "Id": "7",
      "Title": "Store Operations - Efficiency and Profitability Metrics",
      "Content": "Staffing optimization: Peak coverage ratios (1 cashier per 25 customers/hour), Fresh departments require 30% higher staffing vs packaged goods, Self-checkout adoption reduces labor costs by 18-25%. Space utilization: Fresh perimeter generates 40% of revenue in 25% of space, High-margin categories (bakery, delicatessen) should occupy 15-20% of sales floor, End-cap displays increase category sales by 35-50%. Technology ROI: Electronic shelf labels reduce labor by 40 hours/week, Inventory management systems cut stock-outs by 30%, Energy-efficient refrigeration saves €15K-25K annually per store. Shrinkage control: Fresh produce (2.5-4% acceptable loss), Theft prevention systems reduce losses by 35-45%, Employee training programs decrease shrinkage by 20-30%."
    },
    {
      "Id": "8",
      "Title": "Market Expansion Strategy - Location and Format Intelligence",
      "Content": "Site selection criteria: Population density >2000 people/km² (urban stores), Household income €35K+ (premium positioning), Competitor distance >800m (market saturation analysis), Parking availability (suburban locations require 3-4 spaces per 100m² sales floor). Format optimization: Express stores (400-800m², high-traffic locations, 25-30% higher profit per m²), Hypermarkets (3000-5000m², suburban, require €2M+ weekly turnover for profitability), Neighborhood stores (1000-2000m², residential areas, focus on convenience and fresh). Investment analysis: ROI targets (15-20% for new stores, 12-15% for renovations), Payback period (3-4 years urban, 4-5 years suburban), Market penetration: Brussels (oversaturated, focus on format optimization), Flemish suburbs (expansion opportunities, 12-15% growth potential), Wallonia (underserved markets, higher risk but 20-25% growth potential)."
    },
    {
      "Id": "9",
      "Title": "Weekly Performance Analytics - Multi-Store Dashboard July 2025",
      "Content": "Week 27 Performance Summary: Brussels Ixelles flagship: Revenue €67,200 (+3.2% vs target), Margin 28.5% (+0.5%), Customer count 1,247/day (+47), Average basket €53.8 (+€2.1). Brussels Etterbeek: Revenue €43,100 (-4.1% vs target), Margin 23.8% (-1.2%), Customer count 789/day (-23), Average basket €54.7 (+€1.3). Antwerp Zuid: Revenue €58,900 (+1.8% vs target), Margin 26.2% (+0.3%), Customer count 1,089/day (+12). Key insights: Ixelles outperforming due to summer tourism (+15% international customers), Etterbeek declining requires immediate intervention, Antwerp stable growth trajectory. Action items: Maintain Ixelles premium strategy, implement Etterbeek promotional campaign (-5% fresh produce), monitor Antwerp capacity expansion needs."
    }
  ]
}
